Tekla Open API Reference for Tekla Structures 2025
AnalysisNodeLink Methods
The AnalysisNodeLink type exposes the following members.
Methods
Name | Description
Delete
 Deletes a user analysis node link. The ID has to be set.
Insert
 Inserts a user analysis node link. The AnalysisModelName has to be set. The StartNodeID has to be set. The EndNodeID has to be set.
Modify
 Modifies an analysis node link. The ID has to be set.
Select
 Selects an analysis node link. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisNodeLink Class
Tekla.Structures.Analysis Namespace